
    {% extends 'post_template.html' %}

    {% block title %}
        4 anys de Wikipedia
    {% endblock %}

    {% block author %}
        cpina
    {% endblock %}

    {% block post_date %}
        2005-01-15 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Avui 15 de gener la Wikipedia (<a href="http://en.wikipedia.org/wiki/Main_Page">versi&oacute; anglesa</a>) compleix 4 anys.<br /> <br /> Personalment pensava que seria un projecte amb m&eacute;s de temps i &eacute;s prou recent, amb uns 450.000 articles (l&#39;Enciclopedia Espasa compta amb uns 160.000, tot i que s&#39;ha de dir que alguns de la Wikipedia s&oacute;n introducci&oacute; i s&#39;han d&#39;ampliar m&eacute;s).<br /> <br /> La <a href="http://ca.wikipedia.org/wiki/Portada">versi&oacute; catalana</a> va ser comen&ccedil;ada al Mar&ccedil; del 2001 (uns mesos despr&eacute;s del comen&ccedil;ament de l&#39;anglesa) i ja compte amb quasi 12.000 articles (gr&agrave;cies a tothom qui amplia la catalana!)<br /> <br /> Per qui no ho s&agrave;piga, la Wikipedia &eacute;s una enciclopedia feta per tothom (tothom pot editar p&agrave;gines) i amb molta qualitat. Jo la faig servir prou sovint i a vegades &eacute;s convenient substituir alguna cerca al Google per una cerca a la Wikipedia, ja que la quantitat d&#39;informaci&oacute; que cont&eacute; &eacute;s molt alta i molt ben organitzada i presentada.<br /> <br /> Tothom pot modificar (fer nous articles, corregir anteriors) de la Wikipedia; per&ograve; cal remarcar que &eacute;s f&agrave;cil comprovar l&#39;historial de la p&agrave;gina a &quot;History&quot; (part superior de la p&agrave;gina) i a vegades a &quot;Discussion&quot; hi ha discusions prou interessants.<br /> <br /> La llic&egrave;ncia de la Wikipedia &eacute;s la <a href="http://en.wikipedia.org/wiki/Wikipedia:Text_of_the_GNU_Free_Documentation_License">GNU Free Documentation</a>.</span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    