
    {% extends 'post_template.html' %}

    {% block title %}
        Accelerar la navegació amb Firefox
    {% endblock %}

    {% block author %}
        EliziR
    {% endblock %}

    {% block post_date %}
        2005-01-12 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">He trobat un <a href="http://www.freerepublic.com/focus/f-news/1299854/posts">petit escrit</a> on descriu una manera d&#39;accelerar la navegaci&oacute; amb <a href="http://www.mozilla.org/products/firefox/">Firefox</a>.<br /> <br /> Sembla que el tema est&agrave; amb fer un nombre m&eacute;s grans de peticions de les qu&egrave; ja fa el navegador (pipelining), i amb qu&egrave; no s&#39;esperi gens a mostrar el qu&egrave; ha baixat (b&eacute;, aix&ograve; no accelera, sin&oacute; que &eacute;s una falsa sensaci&oacute; :P ).<br /> <br /> Sembla que nom&eacute;s es nota amb connexi&oacute;ns r&agrave;pides (suposo que vol dir a partir d&#39;ADSL 256/128kbps).<br /> <br /> El qu&egrave; no s&eacute;, &eacute;s si fent pipelining (fer m&eacute;s peticions) es pot arribar a sobrecarregar un servidor sota una connexi&oacute; no gaire r&agrave;pida. &Eacute;s a dir, que no crec que a <a href="http://www.google.com/ca">Google</a> li importi gaire, per&ograve; potser a un servidor com ara el qu&egrave; podem tenir a casa, amb una velocitat de pujada de 128kbps, que li facin tantes peticions de cop...<br /> <br /> B&eacute;, jo ho he probat, i no s&eacute; si m&#39;ho sembla per&ograve; sembla que m&#39;ha anat millor. O aix&ograve;, o &eacute;s que el mldonkey en aquell moment no xuclava molt :D<br /> <br /> Si alg&uacute; ho fa i creu que li va b&eacute;, que ho digui si us plau!!!</span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item comment">Re: Accelerar la navegació amb Mmmm, aquesta noticia l'he vist repetida a moltes pàgines Web, fins i tot a les news. I en totes d'acaba discutint tb en els comentaris a veure si es sobrecarrega més un servidor web. Obviament jo crec que si. Els navegadors per defecte ja fan un mica de pipelinig (inclós l'Internet Explorer :P), si soporten HTTP 1.1 (amb cosetes com el keepalive i tal), per augmentar el rendiment. L'únic que fem amb aquetes opcions és accentuar aquest funcionament. El que ens pot pasar amb aixó és que amb servidors molt carregats, obtinguem més resultats fallits al cargar elements d'una web com p.ex. les imatges que conté.<p class="comment-author">Escrit al 2006-12-28 23:40:06 per Sachiel</p></li><li class="list-group-item comment">Re: Accelerar la navegació amb Dues paraules:
conexions persistents

:)<p class="comment-author">Escrit al 2006-12-28 23:40:45 per Anònim</p></li><li class="list-group-item comment">Re: Accelerar la navegació amb 
He trobat un altre lloc on explica el mateix, i encara més. No els he probat, són masses ^^ :

http://www.tweakfactor.com/articles/tweaks/firefoxtweak/4.html<p class="comment-author">Escrit al 2006-12-28 23:41:12 per Elizir</p></li>
    {% endblock %}

    