
    {% extends 'post_template.html' %}

    {% block title %}
        Dacco i QDacco
    {% endblock %}

    {% block author %}
        cpina
    {% endblock %}

    {% block post_date %}
        2005-09-25 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Fa uns dies, via el blog de <a href="http://www.caballe.com/2005/09/14.html">Xavi Caball&eacute;</a> (i not&iacute;cia a <a href="http://puntbarra.com/node/view/2716">Puntbarra</a>) vaig descobrir el projecte <a href="http://www.catalandictionary.org/">Dacco</a>, el qual &eacute;s un projecte que permet tenir un diccionari catal&agrave;-angl&egrave;s i angl&egrave;s-catal&agrave; de forma totalment lliure (feta per la comunitat, sense basar-se en altres diccionaris, etc.)<br /> <br /> Vaig trobar a faltar una eina per consultar les dades sense connexi&oacute; (es podia fer amb PDF i amb Firefox). Aix&iacute; que v&agrave;rem comen&ccedil;ar a fer el QDacco, el qual &eacute;s una interf&iacute;cie amb les Qt&#39;s (les llibreries gr&agrave;fiques que utiltiza KDE), totalment funcional, tant per Linux com per Windows.<br /> <br /> <a href="http://www.ibiblio.org/dacco/cat/?q=node/30">Aqu&iacute;</a> en podeu llegir la refer&egrave;ncia amb instruccions. Si teniu qualsevol problema, sugeriment, etc. us podeu posar en contacte amb mi (correu electr&ograve;nic o deixeu un comentari aqu&iacute;)<br /> <br /> &Eacute;s, tal com es comenta a la not&iacute;cia de Dacco, la versi&oacute; 0.2. Hauria de ser funcional sense problema, per&ograve; no ha estat (encara) ampliament provada. <br /> <br /> Si alg&uacute; est&agrave; interessat en el projecte Dacco, hi ha una llista de correu on podeu participar per aportar-hi noves paraules, exemples, etc. La llista es pot trobar <a href="http://lists.sourceforge.net/lists/listinfo/dacco-users">aqu&iacute;</a>, i un llistat de preguntes freq&uuml;ents a <a href="http://www.ibiblio.org/dacco/cat/?q=node/28">aquesta p&agrave;gina.</a></span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    