
    {% extends 'post_template.html' %}

    {% block title %}
        GPL 3: ja ha arribat
    {% endblock %}

    {% block author %}
        cpina
    {% endblock %}

    {% block post_date %}
        2007-06-30 10:08:27
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <p>Divendres 29 de Juny. Despr&eacute;s de m&eacute;s d&#39;any i mig la versi&oacute; 3.0 de la llic&egrave;ncia GPL ha estat alliberada. &Eacute;s la llic&egrave;ncia &quot;mare&quot; del programari lliure: t&eacute; molta quota de mercat de llic&egrave;ncies de PL i a m&eacute;s a m&eacute;s &eacute;s inspiraci&oacute; d&#39;altres moltes llic&egrave;ncies.</p><p>&nbsp;</p><p>En 26 anys nom&eacute;s hi havia hagut dos versions: la inicial i la segona. Aix&iacute; que la publicaci&oacute; d&#39;aquesta nova llic&egrave;ncia &eacute;s molt important!</p><p>&nbsp;</p><p>Durant el proc&eacute;s d&#39;escriptura s&#39;ha debatut molt la conveni&egrave;ncie de la llic&egrave;ncia. Els casos m&eacute;s sonats s&oacute;n que Linus Torvalds no li feia el pes (sembla que encara no li fa totalment el pes per&ograve; li agrada m&eacute;s) i que Sun va dir que, un cop hi hagi la versi&oacute; definitiva, en principi es passaria a la nova llic&egrave;ncia paulatinament.</p><p>&nbsp;</p><p>La difer&egrave;ncia b&agrave;sica (si us plau, reviseu l&#39;enlla&ccedil; final) &eacute;s que no permet la Tivonitzaci&oacute;: el qu&egrave; va passar amb cert hardware que feia servir programari lliure per&ograve; via hardware es limitava les llibertats. Tamb&eacute; trenca acords que puguin fer entre empreses amb tractes a favor, ajuda a lluitar contra les patents, etc.&nbsp;</p><p>Av&iacute;s: no he estudiat encara la llic&egrave;ncia, aix&iacute; que hi pot haver incorreccions!&nbsp;</p><p>&nbsp;</p><p>Podeu trobar-ne m&eacute;s informaci&oacute; a la Web de la <a href="http://gplv3.fsf.org/">GPL v3.0</a>  </p>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    