
    {% extends 'post_template.html' %}

    {% block title %}
        Informació general
    {% endblock %}

    {% block author %}
        admin
    {% endblock %}

    {% block post_date %}
        2006-12-29 11:06:18
    {% endblock %}

    {% block categories %}
        Informació general, Nosaltres
    {% endblock %}

    {% block post %}
        <h2><u>TROBADES CATUX</u></h2><br /> <br /> Tots els socis de Catux, i qualsevol persona interessada en el tema, pot venir cada diumenge a les trobades que fem a Sant Joan. Ens solem trobar a les 6 de la tarda al local de l&#39;Acad&egrave;mia d&#39;inform&agrave;tica (C/ Dr. Tarr&eacute;s n&ordm; 24). A la web del poble hi trobareu un pl&agrave;nol <a href="http://www.santjoanv.org/">http://www.santjoanv.org</a>), i ens hi quedem fins a les 10 de la nit.<br /> <br /> Si t&#39;agrada el que fem, i vols anar venint amb regularitat, el que llavors demanem, &eacute;s que la gent &eacute;s faci soci de l&#39;associaci&oacute;. S&#39;han de pagar 20&euro; a l&#39;any.<br /> <br /> Amb aquests diners (que s&#39;utilitzen per les despeses de l&#39;associaci&oacute;), es tenen una s&egrave;rie d&#39;avantatges que com m&eacute;s va, m&eacute;s avantatges s&oacute;n.<br /> <br /> Si voleu fer-vos soci/donaci&oacute; podeu fer un ingr&eacute;s de 20&euro; a la seg&uuml;ent compte banc&agrave;ria:<br /> <br /> 2100-3312-91-2200073546 (entitat: la Caixa Pensions)<br /> <br /> Especifiqueu el nom de qui fa l&#39;ingr&eacute;s.<br /> <br /> <br /> <h2><u>AVANTATGES DELS SOCIS</u></h2><br /> <br /> Tots els socis de Catux tenim una s&egrave;rie d&#39;avantatges que a m&eacute;s, les anem ampliant tot sovint. Tot seguit hi ha una llista de les actuals:<br /> <br /> - Possibilitat de tenir una redirecci&oacute; web pr&ograve;pia<br /> - Redirecci&oacute; de direcci&oacute; d&#39;e-mail<br /> - Carnet de soci<br /> - Possibilitat de venir cada diumenge a les xerrades, i actes en general de l&#39;associaci&oacute; i participar-hi d&#39;una manera activa.<br /> - Preus m&eacute;s econ&ograve;mics pel qu&egrave; fa a samarretes<br /> - Informaci&oacute; sobre les diferents ofertes de feina (Molta gent s&#39;adre&ccedil;a a nosaltres per demanar t&egrave;cnics en Linux)<br /> <br /> <h2><u>QU&Egrave; ES FA ELS DIUMENGES</u></h2><br /> <br /> En principi, cada diumenge es fan diferents activitats:<br /> <br /> - Es parla de les novetats de l&#39;associaci&oacute;, ja siguin activitats, gent que s&#39;ha posat en contacte o coses aix&iacute;<br /> - Es fa una estoneta de resoldre dubtes, problemes i aconsellar a la gent que ho necessita, principalment est&agrave; destinat als m&eacute;s nous en el m&oacute;n.<br /> - Cada setmana alg&uacute; es treballa un tema d&#39;explicaci&oacute; en el que ell hi est&agrave; interessat i ho explica a l&#39;altre gent.<br /> - Es fa un descans per anar a pendre alguna cosa, i despr&eacute;s es continua amb l&#39;explicaci&oacute; o el que s&#39;estigu&eacute;s fent.<br /> <br /> <br /> <h2><u>COM APUNTAR-SE A LES LLISTES DE DISTRIBUCI&Oacute;</u></h2><br /> <br /> Si voleu visitar o/i apuntar-vos a qualsevol de les llistes de distribuci&oacute; de CaTuX, ho podeu fer anant a: <a href="llistes/">http://catux.org/llistes/</a> Aqu&iacute; podreu trobar les llistes obertes a tothom amb una breu explicaci&oacute; de la seva utilitat.
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    