
    {% extends 'post_template.html' %}

    {% block title %}
        Ja ha sortit la nova Ubuntu!
    {% endblock %}

    {% block author %}
        franhp
    {% endblock %}

    {% block post_date %}
        2007-04-19 16:51:21
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <p>Si ja vam mencionar la <a href="https://wiki.ubuntu.com/CatalanTeam/festafeisty" target="_blank"><strong>Festa Feisty</strong></a> , avui cal mencionar doncs la sortida de la nova versi&oacute; de Ubuntu, la <strong>Ubuntu Feisty Fawn</strong> <strong>7.04</strong>. Hi ha tanta gent esperant que fins i tot la p&agrave;gina de ubuntu est&agrave; saturada.</p><p>Aquesta nova versi&oacute; inclou un kernel 2.6.20, Gnome 2.18, Openoffice 2.2.0, etc. Tamb&eacute; cal mencionar que Totem &eacute;s capa&ccedil; de detectar quins c&oacute;decs et falten i instal&middot;lar-los, simplificant aix&iacute; la tasca m&eacute;s d&iacute;ficil que els usuaris trobaven en versions anteriors. </p><p>&Eacute;s tan simple d&#39;instal&middot;lar i fer anar que jo (que la primera cosa que faig en arrancar &eacute;s obrir una consola) encara no he tingut cap necessitat de obrir una terminal. La instal&middot;laci&oacute; m&#39;ha deixat un sistema llest per triomfar i a sobre he pogut instal&middot;lar els controladors d&#39;nvidia senzillament amb un assistent que est&agrave; a Sistema -&gt; Administrador -&gt; Gestor de controladors restringits. Gr&agrave;cies a aix&ograve;, he pogut disposar de <strong>efectes tridimensionals</strong> al meu escriptori en un tres i no res, encara que no funcionaven del tot b&eacute; al meu ordinador, suposu que haur&eacute; de fer certes modificacions a la configuraci&oacute; de Xorg 7.2 !</p><p>Sens dubte una distribuci&oacute; que mereix la pena per la seva facilitat de cara a l&#39;usuari final. </p><p>&nbsp;</p><p>Podeu aconseguir la vostre c&ograve;pia a:&nbsp; <a href="http://releases.ubuntu.com/feisty/" target="_blank">http://releases.ubuntu.com/feisty/</a> </p>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item comment">Funcionant Hola. Jo la vaig instal·lar en versió beta fa com un mes. Instalada en el portatil tot funciona correctament. Realment una bona versió, que apropa cada cop més als escriptoris.<p class="comment-author">Escrit al 2007-04-21 21:08:33 per canetenc</p></li>
    {% endblock %}

    