
    {% extends 'post_template.html' %}

    {% block title %}
        Jornades PL: compte endarrera, inscripcions tallers
    {% endblock %}

    {% block author %}
        cpina
    {% endblock %}

    {% block post_date %}
        2006-06-27 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Queda una setmana i un dia perqu&egrave; comencin les <a href="http://jornadespl.org/">Jornades de PL</a>, aquest any un altre cop a Barcelona.<br /> <br /> Hi ha disponible un <a href="http://portal.jornadespl.org/biblioteca/v-jornades/papereria/programa-a4.pdf/download">programa provisional</a> aix&iacute; com el <a href="http://portal.jornadespl.org/biblioteca/v-jornades/papereria/triptic.pdf/view">tr&iacute;ptic.</a><br /> <br /> Ja est&agrave; <strong>oberta l&#39;inscripci&oacute;</strong> a les jornades (necessaria i gratu&iuml;ta). Es pot realitzar des del <a href="http://portal.jornadespl.org/">Portal de les Jornades.</a><br /> <br /> &Eacute;s necessari, i amb l&iacute;mit de places, les <strong>inscripcions als tallers</strong> (cal registrar-se a les Jornades per registrar-se als tallers). Recordar que Catux fa dos tallers: &quot;Instal.laci&oacute; i &uacute;s a nivell d&rsquo;escriptori d&rsquo;una distribuci&oacute;&quot; i &quot;Ofim&agrave;tica amb GNU/Linux&quot;. Com sempre, intenteu fer c&ograve;rrer la veu a la gent que hi pot estar interessada per&ograve; no est&agrave; al m&oacute;n del Programari Lliure ni GNU/Linux i per tant potser no sabr&agrave; de l&#39;exist&egrave;ncia d&#39;aquests tallers.<br /> <br /> Catux tamb&eacute; fa un tutorial un debat/forum sobre els problemes del PL i un tutorial de Python+Qt.<br /> <br /> A les jornades hi haur&agrave;, com cada any, un gran nombre de pon&egrave;ncies de temes relacionats amb el PL, aix&iacute; com diverses confer&egrave;ncies de Plone i confer&egrave;ncies invitades, etc. Mireu el <a href="http://portal.jornadespl.org/biblioteca/v-jornades/papereria/programa-a4.pdf/download">programa</a> per veure-ho millor.</span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    