
    {% extends 'post_template.html' %}

    {% block title %}
        Llançament Debian GNU/Linux 4.0
    {% endblock %}

    {% block author %}
        franhp
    {% endblock %}

    {% block post_date %}
        2007-04-09 19:16:41
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <p>El projecte Debian es complau d&#39;anunciar la publicaci&oacute; oficial de la versi&oacute; 4.0 de Debian GNU/Linux, amb nom clau &laquo;etch&raquo;, despr&eacute;s de 21 mesos de constant desenvolupament. Debian GNU/Linux &eacute;s un sistema operatiu lliure que suporta un total d&#39;onze arquitectures de processadors i inclou els entorns d&#39;escriptori KDE, GNOME i Xfce. </p><p><br />Amb el nou proc&eacute;s d&#39;instal&middot;laci&oacute; completament integrat, Debian GNU/Linux 4.0 permet de forma innovadora l&#39;&uacute;s de particions xifrades. &nbsp;Aquest llan&ccedil;ament introdueix un entorn gr&agrave;fic d&#39;instal&middot;laci&oacute; desenvolupat de nou que suporta sistemes d&#39;escriptura amb car&agrave;cters compostos i idiomes complexos; el sistema d&#39;instal&middot;laci&oacute; per a Debian GNU/Linux s&#39;ha tradu&iuml;t a 58 idiomes.<br /><br />A partir de Debian GNU/Linux 4.0, el sistema de gesti&oacute; de paquets ha millorat pel que fa a seguretat i efici&egrave;ncia. L&#39;APT segur permet la verificaci&oacute; de la integritat dels paquets descarregats des de les r&egrave;pliques. &nbsp;Els &iacute;ndexs de paquets actualitzats no es descarregaran per complet, sin&oacute; que s&#39;actualitzen amb fitxers m&eacute;s petits que contenen nom&eacute;s les difer&egrave;ncies respecte les versions anteriors. </p><p>&nbsp;</p><p>Debian GNU/Linux es pot descarregar ara mateix a trav&eacute;s de bittorrent (la manera recomanada), jigdo o HTTP; llegiu per a m&eacute;s informaci&oacute; &lt;<a href="http://www.debian.org/CD/" target="_blank" onclick="return top.js.OpenExtLink(window,event,this)">http://www.debian.org/CD/</a>&gt;. &nbsp;Aviat tamb&eacute; estar&agrave; disponible en DVD i CD-ROM per part de nombrosos venedors, vegeu vendors &lt;<a href="http://www.debian.org/CD/vendors" target="_blank" onclick="return top.js.OpenExtLink(window,event,this)">http://www.debian.org/CD/vendors</a>&gt;.</p><p>&nbsp;</p><p>Gr&agrave;cies per existir, Debian!&nbsp;</p>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    