
    {% extends 'post_template.html' %}

    {% block title %}
        Més català a Debian: Dacco i qdacco 0.4
    {% endblock %}

    {% block author %}
        cpina
    {% endblock %}

    {% block post_date %}
        2006-04-20 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Fa molt temps <a href="http://catux.org/index.php?num=340">es va comentar</a> aqu&iacute; mateix de l&#39;exist&egrave;ncia del projecte <a href="http://www.catalandictionary.org/catala/?learn&amp;english">Dacco</a>, i tamb&eacute; d&#39;un programa anomenat <a href="http://www.catalandictionary.org/cat/?q=node/32">qdacco</a>.<br /> <br /> Recordar que Dacco &eacute;s un diccionari angl&egrave;s-catal&agrave; i catal&agrave;-angl&egrave;s amb llic&egrave;ncia LGPLG, que s&#39;ha constru&iuml;t des de zero amb l&#39;aportaci&oacute; de gent. Ara per ara t&eacute; m&eacute;s de 10.000 entrades amb cada llengua, exemples, notes d&#39;&uacute;s, etc. qdacco &eacute;s una interf&iacute;cie gr&agrave;fica per accedir en local a les dades del diccionari, apart d&#39;enviar suggeriments, paraules noves, etc.<br /> <br /> Ja fa unes setmanes que Dacco est&agrave; disponible dins Debian unstable i testing, junt amb qdacco.<br /> <br /> A m&eacute;s a m&eacute;s fa pocs dies s&#39;ha alliberat la versi&oacute; 0.4 de qdacco, que afegeix funcionalitats for&ccedil;a interessants respecte les versions anteriors i una interf&iacute;cie gr&agrave;fica molt millorada.<br /> <br /> La nova versi&oacute; es pot trobar a la <a href="http://www.catalandictionary.org/catala/?q=node/32">Web de qdacco</a> com dins mateix <a href="http://packages.debian.org/cgi-bin/search_packages.pl?keywords=qdacco&amp;searchon=names&amp;subword=1&amp;version=all&amp;release=all">Debian</a>.<br /> Aix&iacute; per instal&middot;lar-la nom&eacute;s cal un apt-get install qdacco (o aptitude install qdacco). A la seva Web es pot descarregar el codi font per compilar-ho per altres distribucions.<br /> <br /> M&eacute;s informaci&oacute; a la <a href="http://www.catalandictionary.org/catala/?learn&amp;english">Web de Dacco</a>.</span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    