
    {% extends 'post_template.html' %}

    {% block title %}
        Microsoft i pamflets de premsa: mentides?
    {% endblock %}

    {% block author %}
        cpina
    {% endblock %}

    {% block post_date %}
        2006-12-05 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Vagi per endavant que normalment no m&#39;interessa massa qu&egrave; fa Microsoft. No em sol preocupar massa les &quot;noves&quot; (normalment per ells) caracter&iacute;stiques dels seus sistemes privants-de-llibertats (privatius). Per&ograve; aquest cop ha anat una mica massa lluny; i crec que cal comentar qu&egrave; han dit i contrastar-ho m&iacute;nimament.<br /> <br /> He tret informaci&oacute; de la llista admpub de Softcatal&agrave;. Podeu llegir-ne m&eacute;s <a href="http://www.mail-archive.com/admpub%40www.softcatala.net/msg01802.html">aqu&iacute;</a>.<br /> <br /> ---INICI DESINFORMACI&Oacute;<br /> Els mitjans sembla que no han contastrat massa el qu&egrave; diuen. Veure:<br /> &quot;Com que caldr&agrave; refer aplicacions aix&ograve; signifiquen 4000 llocs de treball a catalunya&quot; (ho escriu en Joan Codina a la llista anteriorment dita)<br /> <br /> A la Vanguardia tamb&eacute; <a href="http://www.lavanguardia.es/gen/20061205/51294796435/noticias/windows-vista-y-office-2007-generaran-20.000-empleos-en-el-sector-de-las-tic-microsoft-grau-lleida-universidad-politecnica-pompeu-fabra-generalitat.html">s&#39;omplen la boca</a> (al final hi ha comentaris sobre el PL).<br /> <br /> A l&#39;Avui, <a href="http://www.avui.cat/cgi-bin/resultat?http://www.avui.cat/avui/diari/06/des/05/297970.htm">igual</a>.<br /> ---FINAL DESINFORMACI&Oacute;<br /> <br /> DADES PER COMPARAR:<br /> En Benjam&iacute; Villoslada escriu sobre el tema al seu blog. <a href="http://blog.bitassa.cat/arxiu/2006/12/05/632/">Veieu l&#39;apunt.</a><br /> <br /> En Jordi Mas ha enviat un correu prou interessant i amb dades. El <a href="http://catux.org/%7Epinux/jordimas.txt">deixo aqu&iacute;</a> (no est&agrave; encara als arxius)<br /> <br /> Sembla que cada cop la diuen m&eacute;s grosssa.<br /> <br /> PD: el comentari m&#39;ha recordat aquesta entrada del blog del <a href="http://www.softcatala.org/%7Ejmas/bloc/pivot/entry.php?id=224">Jordi Mas</a>, recomanable llegir-ho. Va sobre el tema de Windows, catal&agrave; i altres falsetats que diuen que ens poden afectar (com a traductors, usuaris, etc. de PL en catal&agrave;; intentant posar sectors d&#39;opini&oacute; en contra)</span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item comment">Com des del començament Aquest és el seu model de negoci, i els estats els ho permeten. Per tot allò de la globalització. A fabor o en contra, però almenys s'enrecorden de la parla catalana -que no nomès Catalunya- y no fan tanta política des de sectors per sort llunyans -radicals-.<p class="comment-author">Escrit al 2006-12-29 17:03:29 per Anònim</p></li><li class="list-group-item comment">Re: Microsoft i pamflets de pr Hola,

Anònim: a mi em sembla que s'enrecorden de la parla catalana només quan ho necessiten: quan el PL està anant a massa sectors, quan el català i el PL poden ser massa forts en altre sectors, etc.

Recomanable aquesta entrada d'el blog d'en Jordi Mas: es veu una mica la projecció històrica i més coses no verdaderes que sembla que diuen...<p class="comment-author">Escrit al 2006-12-29 17:04:02 per cpina</p></li>
    {% endblock %}

    