
    {% extends 'post_template.html' %}

    {% block title %}
        Modificacions a la Web: contrast i/o mida de lletra
    {% endblock %}

    {% block author %}
        cpina
    {% endblock %}

    {% block post_date %}
        2005-12-10 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <p><span class="noticia"><strong>Actualitzaci&oacute;:</strong> Sembla que al final deixarem la p&agrave;gina principal amb la lletra actual (80%), i la dels articles amb la lletra al 80% amb la possibiliat de canviar-la (ja est&agrave; actiu)<br /> <br /> &Eacute;s notori que el Web de Catux t&eacute; com a caracter&iacute;stica la seva foscor.<br /> <br /> Depen del monitor, llum, etc. que pot costar de llegir, aix&iacute; que hem estat fent uns retocs per veure com es pot millorar.<br /> <br /> Aquests passen per incrementar la mida de la lletra (que pels articles sembla necessari) i per modificar el color dels enlla&ccedil;os, que depen de sobre quin gris estan costen de llegir.<br /> <br /> Els articles queden m&eacute;s llegibles, amb la nova mida, per&ograve; la p&agrave;gina principal t&eacute; un aspecte una mica estrany.<br /> <br /> Si voleu, podeu veure la <a href="http://catux.org//?pell=2">p&agrave;gina principal</a> amb la nova mida de lletra i el contrast dels enlla&ccedil;os una mica canviat, o podeu veure si els <a href="http://www.catux.org/index.php?contingut=articles&amp;num=100&amp;pell=2">articles agraden m&eacute;s.</a><br /> <br /> Si voleu canviar un altre cop a l&#39;aspecte inicial, afegiu a la direcci&oacute; on estigueu &quot;&amp;pell=1&quot;.<br /> <br /> Com que hi ha alguns (no tots) elements formatats amb CSS, si voleu fer proves us podeu instal&middot;lar al Firefox <a href="http://chrispederick.com/work/webdeveloper/%3Cbr%20/%3E">aquesta extensi&oacute;</a>. Un cop instal&middot;lada l&#39;extensi&oacute;, al men&uacute; CSS premeu &quot;Edit CSS&quot; i els canvis que feu al CSS es poden veure a la p&agrave;gina al moment. Els colors els podeu trobar en format num&egrave;ric adequat amb el Gimp o b&eacute; amb el KColor si teniu el KDE.</span><br />&nbsp;</p>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    