
    {% extends 'post_template.html' %}

    {% block title %}
        No hi haurà branca 2.7 de Linux?
    {% endblock %}

    {% block author %}
        whats_up
    {% endblock %}

    {% block post_date %}
        2004-07-23 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Tret de <a href="http://puntbarra.com/">puntbarra</a>:<br /> <br /> <a href="http://developers.slashdot.org/developers/04/07/22/0138244.shtml?tid=106&amp;tid=8">Comenten a Slashdot</a> que a la quarta cimera anual de desenvolupadors del nucli han decidit de no crear una branca 2.7 en un futur immediat, sin&oacute; que es treballar&agrave; directament sobre la branca estable, la 2.6, on es podrien aplicar pegats que afegissin o eliminessin caracter&iacute;stiques (i no tant una pol&iacute;tica d&#39;afegir suport per nous dispositius o corregir errors).<br /> <br /> Cal recordar que tradicionalment, les versions amb el segon nombre senar (per exemple 2.3 o 2.5) eren les considerades de desenvolupament, que despr&eacute;s esdevenien estables (2.4, 2.6...).<br /> <br /> A Slashdot hi ha discussi&oacute; pel fet que en l&#39;article original de <a href="http://kerneltrap.org/node/view/3513">KernelTrap</a> es comenta que la visi&oacute; d&#39;Andrew Morton (mantenidor de la branca 2.6) &eacute;s que el nucli 2.6 ser&agrave; el m&eacute;s r&agrave;pid i amb m&eacute;s caracter&iacute;stiques, per&ograve; no necess&agrave;riament el m&eacute;s estable, que aquesta estabilitzaci&oacute; la realitzaran les distribucions (afegint tamb&eacute; que aix&ograve; era de facto el que succe&iuml;a ara).<br /> <br /> Hi ha gent doncs que pensa que aix&ograve; perjudica les distribucions independents, sense capacitat per realitzar aquesta estabilitzaci&oacute;. Hi ha qui diu que en el fons no canvia res, que el passa &eacute;s que el nucli estava massa verd per esdevenir estable (2.5-&gt;2.6) i que en el fons aix&ograve; vol dir que ara es concentren una mica a estabilitzar-lo... Hi ha qui diu que les distribucions agafaran una versi&oacute; (per exemple 2.6.7) i es dedicaran a estabilitzar-la, per&ograve; potser costar&agrave; una mica compartir aquests pegats... O, simplement, que es pret&eacute;n que les millores arribin m&eacute;s r&agrave;pidament al nucli final: que evolucioni de mica a mica i no fent salts.</span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    