
    {% extends 'post_template.html' %}

    {% block title %}
        Openoffice portable i en català!
    {% endblock %}

    {% block author %}
        franhp
    {% endblock %}

    {% block post_date %}
        2006-04-14 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Com b&eacute; sabreu, existeix una versi&oacute; <a href="http://portableapps.com/apps/office/suites/portable_openoffice">portable</a> de la suite ofim&agrave;tica OpenOffice.org, una versi&oacute; de la nostra suite preferida que es pot portar dins el nostre pendrive i utilitzar-la en qualsevol ordinador.<br /> <br /> El problema que tenim &eacute;s que est&agrave; en angl&egrave;s, per&oacute; aix&oacute; t&eacute; f&agrave;cil soluci&oacute;: El primer que hem de descarregar &eacute;s el paquet d&#39;idioma proporcionat per <a href="http://www.softcatala.org/wiki/OpenOffice.org#OpenOffice.org_2.x_.28desenvolupament.29">softcatal&agrave;</a>.<br /> <br /> Aquest paquet l&#39;hem de descomprimir a qualsevol lloc (fent doble clic, no s&#39;ha d&#39;utilitzar cap decompressor), per exemple al nostre escriptori.<br /> <br /> Despr&eacute;s de descomprimir, s&#39;iniciar&agrave; un altre instal&middot;lador dels paquets d&#39;idioma (si no &eacute;s aix&iacute;, executeu setup.exe al directori que acabeu de<br /> descomprimir) i en aquest pas haurem de seleccionar el directori on tenim el nostre openoffice portable, en el meu cas va ser H:/PortableOpenoffice/openoffice/ (cal remarcar que si posem el directori encertat, el programa ens dir&agrave; que ha detectat una versi&oacute; d&#39;openoffice). <br /> <br /> Quan acabem el proc&eacute;s d&#39;instal&middot;laci&oacute;, tindrem el nostre Openoffice portable en catal&agrave;.<br /> <br /> Si voleu instal&middot;lar el diccionari de catal&agrave; consulteu <a href="../../%3Cbr%20/%3Ehttp://catux.org/index.php?contingut=articles&amp;num=107">aquest article</a>, l&#39;informaci&oacute; necess&agrave;ria esta situada al final del document.</span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item comment">Hauriau de deixar el links per descarregar el programa y el paquet en catala.
Gracies.<p class="comment-author">Escrit al 2012-12-19 18:58:08 per Jaume Guerrero Centeno</p></li>
    {% endblock %}

    