
    {% extends 'post_template.html' %}

    {% block title %}
        Projecte Orange
    {% endblock %}

    {% block author %}
        cpina
    {% endblock %}

    {% block post_date %}
        2005-08-17 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Blender &eacute;s un conegut programa de disseny 3D, el qual fa anys que &eacute;s lliure. <br /> <br /> &Uacute;ltimament s&#39;ha potenciat molt les seves capacitats i encara ho far&agrave; m&eacute;s. El nivell &eacute;s equivalent al de 3DStudio.<br /> <br /> Fa uns 15 dies es va posar en marxa el <a href="http://orange.blender.org/">projecte Orange</a>, el qual t&eacute; per objectiu fer una pel&middot;l&iacute;cula per part de les 6 persones m&eacute;s involucrades en Blender, per&ograve; per aix&ograve; necessiten una quantia de diners on tothom hi pot col&middot;laborar <a href="http://blender.org/e-shop/product_info.php?products_id=84">comprant el DVD</a> que cont&eacute; el resultat final (pel&middot;l&iacute;cula a alta definici&oacute;), el proc&eacute;s de creaci&oacute; i tots els fitxers font del disseny.<br /> <br /> Si es col&middot;labora, amb un import de 35&euro; abans de Setembre s&#39;inclou el vostre nom als cr&egrave;dits de la pel&middot;l&iacute;cula.<br /> <br /> Fer la pel&middot;l&iacute;cula tamb&eacute; potenciar&agrave; l&#39;apartat d&#39;animaci&oacute; de Blender, que actualment &eacute;s dels m&eacute;s fluixos i quedar&agrave; al nivell suficient per fer una bona pel&middot;l&iacute;cula.<br /> <br /> El pla de treball &eacute;s que es &quot;tancaran&quot; les 6 persones del projecte a Amsterdam a treballar-hi durant uns 6 mesos.<br /> <br /> Actualment porten 414 compres del DVD (donacions) i s&#39;hauria d&#39;arribar a 1000 donacions.<br /> <br /> Es pot veure el gr&agrave;fic de les donacions a la <a href="http://blender.org/cms/Home.2.0.html">p&agrave;gina principal</a> de Blender.</span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    