
    {% extends 'post_template.html' %}

    {% block title %}
        Què passa si es posa un Pendrive a la rentadora?
    {% endblock %}

    {% block author %}
        cpina
    {% endblock %}

    {% block post_date %}
        2005-01-08 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Com alguns ja sabreu, un dels projectes de Catux &eacute;s la <a href="http://www.catux.org/catux-usb/">Catux-USB</a>, una distribuci&oacute; per utilitzar des d&#39;un Pendrive sense instal&middot;lar i de forma &quot;normal&quot; (actualitzaci&oacute; paquets, personalitzaci&oacute;, etc.)<br /> <br /> A arrel d&#39;aix&ograve; hi ha qui es demana quina resist&egrave;ncia t&eacute; un Pendrive.<br /> <br /> Fa setmanes un component de Catux va posar (sense voler!) un Pendrive &quot;sense marca coneguda&quot; a dins la rentadora, i aquest va ser rentat (en calent, no va dir la temperatura), centr&iacute;fugat i posteriorment a la secadora.<br /> <br /> <strong>Doncs al acabar, el Pendrive no tan sols funcionava sin&oacute; que a m&eacute;s a m&eacute;s contenia totes les dades del comen&ccedil;ament!</strong><br /> <br /> A mi i crec que alg&uacute; m&eacute;s li va sorprendre. Per&ograve; jo no ho provaria amb els meus per all&ograve; que un sabi va dir un cop de &quot;Nunca repitas un experimento que sali&oacute; bien&quot;.<br /> <br /> Per cert, us recordo que un Pendrive diuen que t&eacute; una durada de 1.000.000 d&#39;escriptures a la mateixa zona, que aix&ograve; s&oacute;n molts i molts anys de durada, i m&eacute;s tenint en compte el sistema de buffers/cache de Linux, etc.</span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item comment">Re: Què passa si es posa un Pe yo tambien tengo la misma experiencia... y sobrevivió ;-<p class="comment-author">Escrit al 2006-12-28 23:36:02 per Anònim</p></li><li class="list-group-item comment">Re: Què passa si es posa un Pe 
Doncs el meu pendrive, tambe va passar per la rentadora. Vaig trigar bastant el provarlo, pero quan ho vaig fer, vaig veure que hi havia totes les dades intactes i que funcionava perfectament.

La firma tambe esta intacta ^^.<p class="comment-author">Escrit al 2006-12-28 23:36:38 per seoman</p></li><li class="list-group-item comment">Re: Què passa si es posa un Pe Ostres anònim i seoman, em deixeu ben parat :-D jo pensava que no seria normal posar un Pendrive dins una rentadora i que quedés tot intacte i sembla que sí que és normal.

De fet tampoc sé perquè havia pensat que no, una impresió... però va bé saber-ho!<p class="comment-author">Escrit al 2006-12-28 23:37:31 per cpina</p></li>
    {% endblock %}

    