
    {% extends 'post_template.html' %}

    {% block title %}
        Resum V Jornades PL
    {% endblock %}

    {% block author %}
        Pinucset
    {% endblock %}

    {% block post_date %}
        2006-07-13 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Uns dies acabades les V Jornades de PL on va assistir Catux fem un resum perqu&egrave; sapigueu com van anar.<br /> <br /> Les Jornades van ser a l&#39;UPC de Barcelonai amb m&eacute;s de 110 assistents van ser tot un &egrave;xit; amb m&uacute;ltiples confer&egrave;ncies, xerrades i tallers algunes activitats organitzades per Catux.<br /> <br /> Nosaltres vam organitzar un taller d&#39;introducci&oacute; a GNU/Linux, on pel que es veu la gent va marxar molt contenta despr&eacute;s d&#39;instal&middot;lar i familiaritzar-se amb un entorn d&#39;Ubuntu GNU/Linux. Aquests tallers els considerem molt interessants perqu&egrave; d&#39;aqu&iacute; 5 anys aquesta gent vagi als tallers m&eacute;s avan&ccedil;ats. Hem de fer cantera!<br /> <br /> Tamb&eacute; vem fer una visualitzaci&oacute; del DVD lliure Elephants Dreams, sorgit del projecte Orange, on dos membres de Catux, un dissenyador gr&agrave;fic professional i el traductor del DVD en catal&agrave; van explicar moltes coses de Blender i del DVD.<br /> <br /> Alhora vem fer la m&iacute;tica xerrada amb els Postits! On Momp&oacute; va fer veure a nous usuaris l&#39;import&agrave;ncia de la llibertat en el programari.<br /> <br /> Pinux, per la seva part, va fer un taller de PyQt.<br /> <br /> Per&ograve; no nom&eacute;s erem nosaltres, tamb&eacute; hi van haber molt&iacute;ssimes confer&egrave;ncies de Plone, creaci&oacute; de paquets Debian, van venir els creadors de <a href="http://meneame.net/">Men&eacute;ame</a>, una taula rodona sobre l&#39;import&agrave;ncia del programari lliure, Mono, Guifibages i Guifi.net, DRM, Moodle i molt&iacute;ssimes coses m&eacute;s que es farien eternes d&#39;enumerar.<br /> <br /> B&eacute;, espero que els que heu vingut hagueu disfrutat i els que no us veiem l&#39;any vinent!!!</span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item">Sense comentaris</li>
    {% endblock %}

    