
    {% extends 'post_template.html' %}

    {% block title %}
        Resum Game Party III
    {% endblock %}

    {% block author %}
        Pinucset
    {% endblock %}

    {% block post_date %}
        2006-04-16 00:00:00
    {% endblock %}

    {% block categories %}
        Notícies, Últimes notícies
    {% endblock %}

    {% block post %}
        <span class="noticia">Estem aqu&iacute; en plena Game Party per explicar el que hem estat fent, penjarem les fotos m&eacute;s tard per motius t&egrave;cnics.<br /> <br /> Hem estat el Pinucset, el Grap, el Mario a temps complet, el Pinux de 20:00 a 1:00 i el Toni; que ha estat una estona per la tarda i unes tres hores per la nit, fins a les 5 que ha marxat perqu&egrave; dem&agrave; (avui) s&#39;havia de llevar d&#39;hora...<br /> <br /> Durant tot aquest temps hem pogut fer molt&iacute;ssimes coses!:<br /> <br /> Hem jugat al Mame amb mandos que ha dut el Mario al projector(al Pang, Street Fighter) i molts m&eacute;s jocs que ens han recordat les antigues recreatives.<br /> <br /> Hem pogut disfrutar de les ja gaireb&eacute; oblidades Game Boys Color, on el Mario i el Pinux s&#39;han donat uns vicis al Tetris impressionants (amb cable, uns versus).<br /> <br /> Hem fet moltes partides a la Nintendo i a la Super Nintendo que ha dut el Pinux, amb els seus mandos originals i els seus m&iacute;tics jocs (Street Fighter, Mario Bros, motos...).<br /> <br /> Despr&eacute;s d&#39;aix&ograve; hem anat a buscar uns altaveus i unes pizzes al Telepizza per sopar.<br /> <br /> A continuaci&oacute; hem mirat una peli al projector (Constatine), de exorcistes, dimonis i tal.<br /> <br /> Despr&eacute;s de la pel&middot;l&iacute;cula ens hem estat intercanviant uns fitxers i a continuaci&oacute;, ben entrada la nit, de 4 a 5; el Pinucset, el Mario, el Grap i el Toni hem estat jugant a l&#39;Enemy Territory als nostres ordinadors, primer en local i despr&eacute;s en un servidor p&uacute;blic.<br /> <br /> Un cop ens hem cansat de l&#39; Enemy Territory hem estat jugant a un Deatmach al Quake III en xarxa local.<br /> <br /> Quan per all&agrave; les 6 ja estavem cansats dels jocs hem anat al projector on hem mirat un parell d&#39;episodis dels Simpsons que el Pinucset ha dut.<br /> <br /> Per&ograve; tot aix&ograve; no s&#39;acaba, ara estem probant uns jocs a Linux i encara ens queda molt fins a les 11, que ens despedirem i recollirem tot!<br /> <br /> Ja s&#39;ha acabat la GameParty i ja hem pujat les fotos a la galeria, que podeu veure <a href="http://catux.org/fotos/index.php?list=18">aqu&iacute;</a></span>
    {% endblock %}

    {% block comments %}
        <li class="list-group-item comment">Re: Resum Game Party III 
Em fa ràbia no poder haver vingut!<p class="comment-author">Escrit al 2006-12-29 16:15:45 per Anònim</p></li><li class="list-group-item comment">Re: Resum Game Party III La pròxima que es faci, quasi si és amb tants jocs de l'època, es diu "Game[Retro] Party" :-)

Ja direu quins jocs veu provar per Linux...<p class="comment-author">Escrit al 2006-12-29 16:17:15 per cpina</p></li>
    {% endblock %}

    